AI6YP/XAPOH/sw/common/gd32vf103xb.h
/* APB2RSTR */
#define RCC_APB2RSTR_AFIORST_Pos   ( 0U )
#define RCC_APB2RSTR_AFIORST_Msk   ( 0x1UL << RCC_APB2RSTR_AFIORST_Pos )
#define RCC_APB2RSTR_AFIORST       ( RCC_APB2RSTR_AFIORST_Msk )
#define RCC_APB2RSTR_IOPARST_Pos   ( 2U )
#define RCC_APB2RSTR_IOPARST_Msk   ( 0x1UL << RCC_APB2RSTR_IOPARST_Pos )
#define RCC_APB2RSTR_IOPARST       ( RCC_APB2RSTR_IOPARST_Msk )
#define RCC_APB2RSTR_IOPBRST_Pos   ( 3U )
#define RCC_APB2RSTR_IOPBRST_Msk   ( 0x1UL << RCC_APB2RSTR_IOPBRST_Pos )
#define RCC_APB2RSTR_IOPBRST       ( RCC_APB2RSTR_IOPBRST_Msk )
#define RCC_APB2RSTR_IOPCRST_Pos   ( 4U )
#define RCC_APB2RSTR_IOPCRST_Msk   ( 0x1UL << RCC_APB2RSTR_IOPCRST_Pos )
#define RCC_APB2RSTR_IOPCRST       ( RCC_APB2RSTR_IOPCRST_Msk )
#define RCC_APB2RSTR_IOPDRST_Pos   ( 5U )
#define RCC_APB2RSTR_IOPDRST_Msk   ( 0x1UL << RCC_APB2RSTR_IOPDRST_Pos )
#define RCC_APB2RSTR_IOPDRST       ( RCC_APB2RSTR_IOPDRST_Msk )
#define RCC_APB2RSTR_IOPERST_Pos   ( 6U )
#define RCC_APB2RSTR_IOPERST_Msk   ( 0x1UL << RCC_APB2RSTR_IOPERST_Pos )
#define RCC_APB2RSTR_IOPERST       ( RCC_APB2RSTR_IOPERST_Msk )
#define RCC_APB2RSTR_ADC1RST_Pos   ( 9U )
#define RCC_APB2RSTR_ADC1RST_Msk   ( 0x1UL << RCC_APB2RSTR_ADC1RST_Pos )
#define RCC_APB2RSTR_ADC1RST       ( RCC_APB2RSTR_ADC1RST_Msk )
#define RCC_APB2RSTR_ADC2RST_Pos   ( 10U )
#define RCC_APB2RSTR_ADC2RST_Msk   ( 0x1UL << RCC_APB2RSTR_ADC2RST_Pos )
#define RCC_APB2RSTR_ADC2RST       ( RCC_APB2RSTR_ADC2RST_Msk )
#define RCC_APB2RSTR_TIM1RST_Pos   ( 11U )
#define RCC_APB2RSTR_TIM1RST_Msk   ( 0x1UL << RCC_APB2RSTR_TIM1RST_Pos )
#define RCC_APB2RSTR_TIM1RST       ( RCC_APB2RSTR_TIM1RST_Msk )
#define RCC_APB2RSTR_SPI1RST_Pos   ( 12U )
#define RCC_APB2RSTR_SPI1RST_Msk   ( 0x1UL << RCC_APB2RSTR_SPI1RST_Pos )
#define RCC_APB2RSTR_SPI1RST       ( RCC_APB2RSTR_SPI1RST_Msk )
#define RCC_APB2RSTR_USART1RST_Pos ( 14U )
#define RCC_APB2RSTR_USART1RST_Msk ( 0x1UL << RCC_APB2RSTR_USART1RST_Pos )
#define RCC_APB2RSTR_USART1RST     ( RCC_APB2RSTR_USART1RST_Msk )
/* AHBENR */
#define RCC_AHBENR_DMA1EN_Pos    ( 0U )
#define RCC_AHBENR_DMA1EN_Msk    ( 0x1UL << RCC_AHBENR_DMA1EN_Pos )
#define RCC_AHBENR_DMA1EN        ( RCC_AHBENR_DMA1EN_Msk )
// Note: DMA2 not present on STM32F103 chips.
#define RCC_AHBENR_DMA2EN_Pos    ( 1U )
#define RCC_AHBENR_DMA2EN_Msk    ( 0x1UL << RCC_AHBENR_DMA2EN_Pos )
#define RCC_AHBENR_DMA2EN        ( RCC_AHBENR_DMA2EN_Msk )
#define RCC_AHBENR_SRAMEN_Pos    ( 2U )
#define RCC_AHBENR_SRAMEN_Msk    ( 0x1UL << RCC_AHBENR_SRAMEN_Pos )
#define RCC_AHBENR_SRAMEN        ( RCC_AHBENR_SRAMEN_Msk )
#define RCC_AHBENR_FLITFEN_Pos   ( 4U )
#define RCC_AHBENR_FLITFEN_Msk   ( 0x1UL << RCC_AHBENR_FLITFEN_Pos )
#define RCC_AHBENR_FLITFEN       ( RCC_AHBENR_FLITFEN_Msk )
#define RCC_AHBENR_CRCEN_Pos     ( 6U )
#define RCC_AHBENR_CRCEN_Msk     ( 0x1UL << RCC_AHBENR_CRCENEN_Pos )
#define RCC_AHBENR_CRCEN         ( RCC_AHBENR_CRCENEN_Msk )
// Note: EXMC not present on STM32F103 chips.
#define RCC_AHBENR_EXMCEN_Pos    ( 8U )
#define RCC_AHBENR_EXMCEN_Msk    ( 0x1UL << RCC_AHBENR_EXMCEN_Pos )
#define RCC_AHBENR_EXMCEN        ( RCC_AHBENR_EXMCEN_Msk )
// Note: USB handled differently on STM32F103 chips.
#define RCC_AHBENR_USBFSEN_Pos   ( 12U )
#define RCC_AHBENR_USBFSEN_Msk   ( 0x1UL << RCC_AHBENR_USBFSEN_Pos )
#define RCC_AHBENR_USBFSEN       ( RCC_AHBENR_USBFSEN_Msk )

/* APB1RSTR */
#define RCC_APB1RSTR_SPI2RST_Pos   ( 14U )
#define RCC_APB1RSTR_SPI2RST_Msk   ( 0x1UL << RCC_APB1RSTR_SPI2RST_Pos )
#define RCC_APB1RSTR_SPI2RST       ( RCC_APB1RSTR_SPI2RST_Msk )
#define RCC_APB1RSTR_SPI3RST_Pos   ( 15U )
#define RCC_APB1RSTR_SPI3RST_Msk   ( 0x1UL << RCC_APB1RSTR_SPI3RST_Pos )
#define RCC_APB1RSTR_SPI3RST       ( RCC_APB1RSTR_SPI3RST_Msk )

/* APB1ENR */
#define RCC_APB1ENR_SPI2EN_Pos   ( 14U )
#define RCC_APB1ENR_SPI2EN_Msk   ( 0x1UL << RCC_APB1ENR_SPI2EN_Pos )
#define RCC_APB1ENR_SPI2EN       ( RCC_APB1ENR_SPI2EN_Msk )
#define RCC_APB1ENR_SPI3EN_Pos   ( 15U )
#define RCC_APB1ENR_SPI3EN_Msk   ( 0x1UL << RCC_APB1ENR_SPI3EN_Pos )
#define RCC_APB1ENR_SPI3EN       ( RCC_APB1ENR_SPI3EN_Msk )
#define RCC_APB1ENR_I2C1EN_Pos   ( 21U )
#define RCC_APB1ENR_I2C1EN_Msk   ( 0x1UL << RCC_APB1ENR_I2C1EN_Pos )
#define RCC_APB1ENR_I2C1EN       ( RCC_APB1ENR_I2C1EN_Msk )
#define RCC_APB1ENR_I2C2EN_Pos   ( 22U )
#define RCC_APB1ENR_I2C2EN_Msk   ( 0x1UL << RCC_APB1ENR_I2C2EN_Pos )
#define RCC_APB1ENR_I2C2EN       ( RCC_APB1ENR_I2C2EN_Msk )

/* APB2ENR */
#define RCC_APB2ENR_AFIOEN_Pos   ( 0U )
#define RCC_APB2ENR_AFIOEN_Msk   ( 0x1UL << RCC_APB2ENR_AFIOEN_Pos )
#define RCC_APB2ENR_AFIOEN       ( RCC_APB2ENR_AFIOEN_Msk )
#define RCC_APB2ENR_IOPAEN_Pos   ( 2U )
#define RCC_APB2ENR_IOPAEN_Msk   ( 0x1UL << RCC_APB2ENR_IOPAEN_Pos )
#define RCC_APB2ENR_IOPAEN       ( RCC_APB2ENR_IOPAEN_Msk )
#define RCC_APB2ENR_IOPBEN_Pos   ( 3U )
#define RCC_APB2ENR_IOPBEN_Msk   ( 0x1UL << RCC_APB2ENR_IOPBEN_Pos )
#define RCC_APB2ENR_IOPBEN       ( RCC_APB2ENR_IOPBEN_Msk )
#define RCC_APB2ENR_IOPCEN_Pos   ( 4U )
#define RCC_APB2ENR_IOPCEN_Msk   ( 0x1UL << RCC_APB2ENR_IOPCEN_Pos )
#define RCC_APB2ENR_IOPCEN       ( RCC_APB2ENR_IOPCEN_Msk )
#define RCC_APB2ENR_IOPDEN_Pos   ( 5U )
#define RCC_APB2ENR_IOPDEN_Msk   ( 0x1UL << RCC_APB2ENR_IOPDEN_Pos )
#define RCC_APB2ENR_IOPDEN       ( RCC_APB2ENR_IOPDEN_Msk )
#define RCC_APB2ENR_IOPEEN_Pos   ( 6U )
#define RCC_APB2ENR_IOPEEN_Msk   ( 0x1UL << RCC_APB2ENR_IOPEEN_Pos )
#define RCC_APB2ENR_IOPEEN       ( RCC_APB2ENR_IOPEEN_Msk )
#define RCC_APB2ENR_ADC1EN_Pos   ( 9U )
#define RCC_APB2ENR_ADC1EN_Msk   ( 0x1UL << RCC_APB2ENR_ADC1EN_Pos )
#define RCC_APB2ENR_ADC1EN       ( RCC_APB2ENR_ADC1EN_Msk )
#define RCC_APB2ENR_ADC2EN_Pos   ( 10U )
#define RCC_APB2ENR_ADC2EN_Msk   ( 0x1UL << RCC_APB2ENR_ADC2EN_Pos )
#define RCC_APB2ENR_ADC2EN       ( RCC_APB2ENR_ADC2EN_Msk )
#define RCC_APB2ENR_TIM1EN_Pos   ( 11U )
#define RCC_APB2ENR_TIM1EN_Msk   ( 0x1UL << RCC_APB2ENR_TIM1EN_Pos )
#define RCC_APB2ENR_TIM1EN       ( RCC_APB2ENR_TIM1EN_Msk )
#define RCC_APB2ENR_SPI1EN_Pos   ( 12U )
#define RCC_APB2ENR_SPI1EN_Msk   ( 0x1UL << RCC_APB2ENR_SPI1EN_Pos )
#define RCC_APB2ENR_SPI1EN       ( RCC_APB2ENR_SPI1EN_Msk )
#define RCC_APB2ENR_USART1EN_Pos ( 14U )
#define RCC_APB2ENR_USART1EN_Msk ( 0x1UL << RCC_APB2ENR_USART1EN_Pos )
#define RCC_APB2ENR_USART1EN     ( RCC_APB2ENR_USART1EN_Msk )

/* AFIO register bit definitions. */
/* MAPR */
#define AFIO_MARP_SPI1_REMAP_Pos  ( 0U )
#define AFIO_MARP_SPI1_REMAP_Msk  ( 0x1UL << AFIO_MARP_SPI1_REMAP_Pos )
#define AFIO_MARP_SPI1_REMAP      ( AFIO_MARP_SPI1_REMAP_Msk )
#define AFIO_MAPR_SWJ_CFG_Pos  ( 24U )
#define AFIO_MAPR_SWJ_CFG_Msk  ( 0x7UL << AFIO_MAPR_SWJ_CFG_Pos )
#define AFIO_MAPR_SWJ_CFG      ( AFIO_MAPR_SWJ_CFG_Msk )
#define AFIO_MARP_SPI2_REMAP_Pos  ( 28U )
#define AFIO_MARP_SPI2_REMAP_Msk  ( 0x1UL << AFIO_MARP_SPI2_REMAP_Pos )
#define AFIO_MARP_SPI2_REMAP      ( AFIO_MARP_SPI2_REMAP_Msk )

/* GPIO register bit definitions. */
/* CRL */
#define GPIO_CRL_MODE_Pos   ( 0U )
#define GPIO_CRL_MODE_Msk   ( 0x33333333UL << GPIO_CRL_MODE_Pos )
#define GPIO_CRL_MODE       ( GPIO_CRL_MODE_Msk )
#define GPIO_CRL_MODE0_Pos  ( 0U )
#define GPIO_CRL_MODE0_Msk  ( 0x3UL << GPIO_CRL_MODE0_Pos )
#define GPIO_CRL_MODE0      ( GPIO_CRL_MODE0_Msk )
#define GPIO_CRL_MODE1_Pos  ( 4U )
#define GPIO_CRL_MODE1_Msk  ( 0x3UL << GPIO_CRL_MODE1_Pos )
#define GPIO_CRL_MODE1      ( GPIO_CRL_MODE1_Msk )
#define GPIO_CRL_MODE2_Pos  ( 8U )
#define GPIO_CRL_MODE2_Msk  ( 0x3UL << GPIO_CRL_MODE2_Pos )
#define GPIO_CRL_MODE2      ( GPIO_CRL_MODE2_Msk )
#define GPIO_CRL_MODE3_Pos  ( 12U )
#define GPIO_CRL_MODE3_Msk  ( 0x3UL << GPIO_CRL_MODE3_Pos )
#define GPIO_CRL_MODE3      ( GPIO_CRL_MODE3_Msk )
#define GPIO_CRL_MODE4_Pos  ( 16U )
#define GPIO_CRL_MODE4_Msk  ( 0x3UL << GPIO_CRL_MODE4_Pos )
#define GPIO_CRL_MODE4      ( GPIO_CRL_MODE4_Msk )
#define GPIO_CRL_MODE5_Pos  ( 20U )
#define GPIO_CRL_MODE5_Msk  ( 0x3UL << GPIO_CRL_MODE5_Pos )
#define GPIO_CRL_MODE5      ( GPIO_CRL_MODE5_Msk )
#define GPIO_CRL_MODE6_Pos  ( 24U )
#define GPIO_CRL_MODE6_Msk  ( 0x3UL << GPIO_CRL_MODE6_Pos )
#define GPIO_CRL_MODE6      ( GPIO_CRL_MODE6_Msk )
#define GPIO_CRL_MODE7_Pos  ( 28U )
#define GPIO_CRL_MODE7_Msk  ( 0x3UL << GPIO_CRL_MODE7_Pos )
#define GPIO_CRL_MODE7      ( GPIO_CRL_MODE7_Msk )
#define GPIO_CRL_CNF_Pos    ( 2U )
#define GPIO_CRL_CNF_Msk    ( 0x33333333UL << GPIO_CRL_CNF_Pos )
#define GPIO_CRL_CNF        ( GPIO_CRL_CNF_Msk )
#define GPIO_CRL_CNF0_Pos   ( 2U )
#define GPIO_CRL_CNF0_Msk   ( 0x3UL << GPIO_CRL_CNF0_Pos )
#define GPIO_CRL_CNF0       ( GPIO_CRL_CNF0_Msk )
#define GPIO_CRL_CNF1_Pos   ( 6U )
#define GPIO_CRL_CNF1_Msk   ( 0x3UL << GPIO_CRL_CNF1_Pos )
#define GPIO_CRL_CNF1       ( GPIO_CRL_CNF1_Msk )
#define GPIO_CRL_CNF2_Pos   ( 10U )
#define GPIO_CRL_CNF2_Msk   ( 0x3UL << GPIO_CRL_CNF2_Pos )
#define GPIO_CRL_CNF2       ( GPIO_CRL_CNF2_Msk )
#define GPIO_CRL_CNF3_Pos   ( 14U )
#define GPIO_CRL_CNF3_Msk   ( 0x3UL << GPIO_CRL_CNF3_Pos )
#define GPIO_CRL_CNF3       ( GPIO_CRL_CNF3_Msk )
#define GPIO_CRL_CNF4_Pos   ( 18U )
#define GPIO_CRL_CNF4_Msk   ( 0x3UL << GPIO_CRL_CNF4_Pos )
#define GPIO_CRL_CNF4       ( GPIO_CRL_CNF4_Msk )
#define GPIO_CRL_CNF5_Pos   ( 22U )
#define GPIO_CRL_CNF5_Msk   ( 0x3UL << GPIO_CRL_CNF5_Pos )
#define GPIO_CRL_CNF5       ( GPIO_CRL_CNF5_Msk )
#define GPIO_CRL_CNF6_Pos   ( 26U )
#define GPIO_CRL_CNF6_Msk   ( 0x3UL << GPIO_CRL_CNF6_Pos )
#define GPIO_CRL_CNF6       ( GPIO_CRL_CNF6_Msk )
#define GPIO_CRL_CNF7_Pos   ( 30U )
#define GPIO_CRL_CNF7_Msk   ( 0x3UL << GPIO_CRL_CNF7_Pos )
#define GPIO_CRL_CNF7       ( GPIO_CRL_CNF7_Msk )
/* CRH */
#define GPIO_CRH_MODE_Pos   ( 0U )
#define GPIO_CRH_MODE_Msk   ( 0x33333333UL << GPIO_CRH_MODE_Pos )
#define GPIO_CRH_MODE       ( GPIO_CRH_MODE_Msk )
#define GPIO_CRH_MODE8_Pos  ( 0U )
#define GPIO_CRH_MODE8_Msk  ( 0x3UL << GPIO_CRH_MODE8_Pos )
#define GPIO_CRH_MODE8      ( GPIO_CRH_MODE8_Msk )
#define GPIO_CRH_MODE9_Pos  ( 4U )
#define GPIO_CRH_MODE9_Msk  ( 0x3UL << GPIO_CRH_MODE9_Pos )
#define GPIO_CRH_MODE9      ( GPIO_CRH_MODE9_Msk )
#define GPIO_CRH_MODE10_Pos ( 8U )
#define GPIO_CRH_MODE10_Msk ( 0x3UL << GPIO_CRH_MODE10_Pos )
#define GPIO_CRH_MODE10     ( GPIO_CRH_MODE10_Msk )
#define GPIO_CRH_MODE11_Pos ( 12U )
#define GPIO_CRH_MODE11_Msk ( 0x11UL << GPIO_CRH_MODE11_Pos )
#define GPIO_CRH_MODE11     ( GPIO_CRH_MODE11_Msk )
#define GPIO_CRH_MODE12_Pos ( 16U )
#define GPIO_CRH_MODE12_Msk ( 0x3UL << GPIO_CRH_MODE12_Pos )
#define GPIO_CRH_MODE12     ( GPIO_CRH_MODE12_Msk )
#define GPIO_CRH_MODE13_Pos ( 20U )
#define GPIO_CRH_MODE13_Msk ( 0x3UL << GPIO_CRH_MODE13_Pos )
#define GPIO_CRH_MODE13     ( GPIO_CRH_MODE13_Msk )
#define GPIO_CRH_MODE14_Pos ( 24U )
#define GPIO_CRH_MODE14_Msk ( 0x3UL << GPIO_CRH_MODE14_Pos )
#define GPIO_CRH_MODE14     ( GPIO_CRH_MODE14_Msk )
#define GPIO_CRH_MODE15_Pos ( 28U )
#define GPIO_CRH_MODE15_Msk ( 0x3UL << GPIO_CRH_MODE15_Pos )
#define GPIO_CRH_MODE15     ( GPIO_CRH_MODE15_Msk )
#define GPIO_CRH_CNF_Pos    ( 2U )
#define GPIO_CRH_CNF_Msk    ( 0x33333333UL << GPIO_CRH_CNF_Pos )
#define GPIO_CRH_CNF        ( GPIO_CRH_CNF_Msk )
#define GPIO_CRH_CNF8_Pos   ( 2U )
#define GPIO_CRH_CNF8_Msk   ( 0x3UL << GPIO_CRH_CNF8_Pos )
#define GPIO_CRH_CNF8       ( GPIO_CRH_CNF8_Msk )
#define GPIO_CRH_CNF9_Pos   ( 6U )
#define GPIO_CRH_CNF9_Msk   ( 0x3UL << GPIO_CRH_CNF9_Pos )
#define GPIO_CRH_CNF9       ( GPIO_CRH_CNF9_Msk )
#define GPIO_CRH_CNF10_Pos  ( 10U )
#define GPIO_CRH_CNF10_Msk  ( 0x3UL << GPIO_CRH_CNF10_Pos )
#define GPIO_CRH_CNF10      ( GPIO_CRH_CNF10_Msk )
#define GPIO_CRH_CNF11_Pos  ( 14U )
#define GPIO_CRH_CNF11_Msk  ( 0x11UL << GPIO_CRH_CNF11_Pos )
#define GPIO_CRH_CNF11      ( GPIO_CRH_CNF11_Msk )
#define GPIO_CRH_CNF12_Pos  ( 18U )
#define GPIO_CRH_CNF12_Msk  ( 0x3UL << GPIO_CRH_CNF12_Pos )
#define GPIO_CRH_CNF12      ( GPIO_CRH_CNF12_Msk )
#define GPIO_CRH_CNF13_Pos  ( 22U )
#define GPIO_CRH_CNF13_Msk  ( 0x3UL << GPIO_CRH_CNF13_Pos )
#define GPIO_CRH_CNF13      ( GPIO_CRH_CNF13_Msk )
#define GPIO_CRH_CNF14_Pos  ( 26U )
#define GPIO_CRH_CNF14_Msk  ( 0x3UL << GPIO_CRH_CNF14_Pos )
#define GPIO_CRH_CNF14      ( GPIO_CRH_CNF14_Msk )
#define GPIO_CRH_CNF15_Pos  ( 30U )
#define GPIO_CRH_CNF15_Msk  ( 0x3UL << GPIO_CRH_CNF15_Pos )
#define GPIO_CRH_CNF15      ( GPIO_CRH_CNF15_Msk )

/* Global DMA register bit definitions. */

/* Per-channel DMA register bit definitions. */
/* CCR / CHCTL */
#define DMA_CCR_EN_Pos      ( 0U )
#define DMA_CCR_EN_Msk      ( 0x1UL << DMA_CCR_EN_Pos )
#define DMA_CCR_EN          ( DMA_CCR_EN_Msk )
#define DMA_CCR_TCIE_Pos    ( 1U )
#define DMA_CCR_TCIE_Msk    ( 0x1UL << DMA_CCR_TCIE_Pos )
#define DMA_CCR_TCIE        ( DMA_CCR_TCIE_Msk )
#define DMA_CCR_HTIE_Pos    ( 2U )
#define DMA_CCR_HTIE_Msk    ( 0x1UL << DMA_CCR_HTIE_Pos )
#define DMA_CCR_HTIE        ( DMA_CCR_HTIE_Msk )
#define DMA_CCR_TEIE_Pos    ( 3U )
#define DMA_CCR_TEIE_Msk    ( 0x1UL << DMA_CCR_TEIE_Pos )
#define DMA_CCR_TEIE        ( DMA_CCR_TEIE_Msk )
#define DMA_CCR_DIR_Pos     ( 4U )
#define DMA_CCR_DIR_Msk     ( 0x1UL << DMA_CCR_DIR_Pos )
#define DMA_CCR_DIR         ( DMA_CCR_DIR_Msk )
#define DMA_CCR_CIRC_Pos    ( 5U )
#define DMA_CCR_CIRC_Msk    ( 0x1UL << DMA_CCR_CIRC_Pos )
#define DMA_CCR_CIRC        ( DMA_CCR_CIRC_Msk )
#define DMA_CCR_PINC_Pos    ( 6U )
#define DMA_CCR_PINC_Msk    ( 0x1UL << DMA_CCR_PINC_Pos )
#define DMA_CCR_PINC        ( DMA_CCR_PINC_Msk )
#define DMA_CCR_MINC_Pos    ( 7U )
#define DMA_CCR_MINC_Msk    ( 0x1UL << DMA_CCR_MINC_Pos )
#define DMA_CCR_MINC        ( DMA_CCR_MINC_Msk )
#define DMA_CCR_PSIZE_Pos   ( 8U )
#define DMA_CCR_PSIZE_Msk   ( 0x3UL << DMA_CCR_PSIZE_Pos )
#define DMA_CCR_PSIZE       ( DMA_CCR_PSIZE_Msk )
#define DMA_CCR_MSIZE_Pos   ( 10U )
#define DMA_CCR_MSIZE_Msk   ( 0x3UL << DMA_CCR_MSIZE_Pos )
#define DMA_CCR_MSIZE       ( DMA_CCR_MSIZE_Msk )
#define DMA_CCR_PL_Pos      ( 12U )
#define DMA_CCR_PL_Msk      ( 0x3UL << DMA_CCR_PL_Pos )
#define DMA_CCR_PL          ( DMA_CCR_PL_Msk )
#define DMA_CCR_MEM2MEM_Pos ( 14U )
#define DMA_CCR_MEM2MEM_Msk ( 0x1UL << DMA_CCR_MEM2MEM_Pos )
#define DMA_CCR_MEM2MEM     ( DMA_CCR_MEM2MEM_Msk )

/* SPI register bit definitions. */
/* CR1 */
#define SPI_CR1_CPHA_Pos     ( 0U )
#define SPI_CR1_CPHA_Msk     ( 0x1UL << SPI_CR1_CPHA_Pos )
#define SPI_CR1_CPHA         ( SPI_CR1_CPHA_Msk )
#define SPI_CR1_CPOL_Pos     ( 1U )
#define SPI_CR1_CPOL_Msk     ( 0x1UL << SPI_CR1_CPOL_Pos )
#define SPI_CR1_CPOL         ( SPI_CR1_CPOL_Msk )
#define SPI_CR1_MSTR_Pos     ( 2U )
#define SPI_CR1_MSTR_Msk     ( 0x1UL << SPI_CR1_MSTR_Pos )
#define SPI_CR1_MSTR         ( SPI_CR1_MSTR_Msk )
#define SPI_CR1_BR_Pos       ( 3U )
#define SPI_CR1_BR_Msk       ( 0x7UL << SPI_CR1_BR_Pos )
#define SPI_CR1_BR           ( SPI_CR1_BR_Msk )
#define SPI_CR1_SPE_Pos      ( 6U )
#define SPI_CR1_SPE_Msk      ( 0x1UL << SPI_CR1_SPE_Pos )
#define SPI_CR1_SPE          ( SPI_CR1_SPE_Msk )
#define SPI_CR1_LSBFIRST_Pos ( 7U )
#define SPI_CR1_LSBFIRST_Msk ( 0x1UL << SPI_CR1_LSBFIRST_Pos )
#define SPI_CR1_LSBFIRST     ( SPI_CR1_LSBFIRST_Msk )
#define SPI_CR1_SSI_Pos      ( 8U )
#define SPI_CR1_SSI_Msk      ( 0x1UL << SPI_CR1_SSI_Pos )
#define SPI_CR1_SSI          ( SPI_CR1_SSI_Msk )
#define SPI_CR1_SSM_Pos      ( 9U )
#define SPI_CR1_SSM_Msk      ( 0x1UL << SPI_CR1_SSM_Pos )
#define SPI_CR1_SSM          ( SPI_CR1_SSM_Msk )
#define SPI_CR1_RXONLY_Pos   ( 10U )
#define SPI_CR1_RXONLY_Msk   ( 0x1UL << SPI_CR1_RXONLY_Pos )
#define SPI_CR1_RXONLY       ( SPI_CR1_RXONLY_Msk )
#define SPI_CR1_DFF_Pos      ( 11U )
#define SPI_CR1_DFF_Msk      ( 0x1UL << SPI_CR1_DFF_Pos )
#define SPI_CR1_DFF          ( SPI_CR1_DFF_Msk )
#define SPI_CR1_CRCNEXT_Pos  ( 12U )
#define SPI_CR1_CRCNEXT_Msk  ( 0x1UL << SPI_CR1_CRCNEXT_Pos )
#define SPI_CR1_CRCNEXT      ( SPI_CR1_CRCNEXT_Msk )
#define SPI_CR1_CRCEN_Pos    ( 13U )
#define SPI_CR1_CRCEN_Msk    ( 0x1UL << SPI_CR1_CRCEN_Pos )
#define SPI_CR1_CRCEN        ( SPI_CR1_CRCEN_Msk )
#define SPI_CR1_BIDIOE_Pos   ( 14U )
#define SPI_CR1_BIDIOE_Msk   ( 0x1UL << SPI_CR1_BIDIOE_Pos )
#define SPI_CR1_BIDIOE       ( SPI_CR1_BIDIOE_Msk )
#define SPI_CR1_BIDIMODE_Pos ( 15U )
#define SPI_CR1_BIDIMODE_Msk ( 0x1UL << SPI_CR1_BIDIMODE_Pos )
#define SPI_CR1_BIDIMODE     ( SPI_CR1_BIDIMODE_Msk )
/* CR2 */
#define SPI_CR2_RXDMAEN_Pos ( 0U )
#define SPI_CR2_RXDMAEN_Msk ( 0x1UL << SPI_CR2_RXDMAEN_Pos )
#define SPI_CR2_RXDMAEN     ( SPI_CR2_RXDMAEN_Msk )
#define SPI_CR2_TXDMAEN_Pos ( 1U )
#define SPI_CR2_TXDMAEN_Msk ( 0x1UL << SPI_CR2_TXDMAEN_Pos )
#define SPI_CR2_TXDMAEN     ( SPI_CR2_TXDMAEN_Msk )
#define SPI_CR2_SSOE_Pos    ( 2U )
#define SPI_CR2_SSOE_Msk    ( 0x1UL << SPI_CR2_SSOE_Pos )
#define SPI_CR2_SSOE        ( SPI_CR2_SSOE_Msk )
// Note: 'NSS pulse mode' and 'TI mode' bits don't show up in
// STM32F103 reference documents.
#define SPI_CR2_NSSP_Pos    ( 3U )
#define SPI_CR2_NSSP_Msk    ( 0x1UL << SPI_CR2_NSSP_Pos )
#define SPI_CR2_NSSP        ( SPI_CR2_NSSP_Msk )
#define SPI_CR2_TIMOD_Pos   ( 4U )
#define SPI_CR2_TIMOD_Msk   ( 0x1UL << SPI_CR2_TIMOD_Pos )
#define SPI_CR2_TIMOD       ( SPI_CR2_TIMOD_Msk )
#define SPI_CR2_ERRIE_Pos   ( 5U )
#define SPI_CR2_ERRIE_Msk   ( 0x1UL << SPI_CR2_ERRIE_Pos )
#define SPI_CR2_ERRIE       ( SPI_CR2_ERRIE_Msk )
#define SPI_CR2_RXNEIE_Pos  ( 6U )
#define SPI_CR2_RXNEIE_Msk  ( 0x1UL << SPI_CR2_RXNEIE_Pos )
#define SPI_CR2_RXNEIE      ( SPI_CR2_RXNEIE_Msk )
#define SPI_CR2_TXEIE_Pos   ( 7U )
#define SPI_CR2_TXEIE_Msk   ( 0x1UL << SPI_CR2_TXEIE_Pos )
#define SPI_CR2_TXEIE       ( SPI_CR2_TXEIE_Msk )
/* SR / STAT */
#define SPI_SR_RXNE_Pos   ( 0U )
#define SPI_SR_RXNE_Msk   ( 0x1UL << SPI_SR_RXNE_Pos )
#define SPI_SR_RXNE       ( SPI_SR_RXNE_Msk )
#define SPI_SR_TXE_Pos    ( 1U )
#define SPI_SR_TXE_Msk    ( 0x1UL << SPI_SR_TXE_Pos )
#define SPI_SR_TXE        ( SPI_SR_TXE_Msk )
#define SPI_SR_CHSIDE_Pos ( 2U )
#define SPI_SR_CHSIDE_Msk ( 0x1UL << SPI_SR_CHSIDE_Pos )
#define SPI_SR_CHSIDE     ( SPI_SR_CHSIDE_Msk )
#define SPI_SR_UDR_Pos    ( 3U )
#define SPI_SR_UDR_Msk    ( 0x1UL << SPI_SR_UDR_Pos )
#define SPI_SR_UDR        ( SPI_SR_UDR_Msk )
#define SPI_SR_CRCERR_Pos ( 4U )
#define SPI_SR_CRCERR_Msk ( 0x1UL << SPI_SR_CRCERR_Pos )
#define SPI_SR_CRCERR     ( SPI_SR_CRCERR_Msk )
#define SPI_SR_MODF_Pos   ( 5U )
#define SPI_SR_MODF_Msk   ( 0x1UL << SPI_SR_MODF_Pos )
#define SPI_SR_MODF       ( SPI_SR_MODF_Msk )
#define SPI_SR_OVR_Pos    ( 6U )
#define SPI_SR_OVR_Msk    ( 0x1UL << SPI_SR_OVR_Pos )
#define SPI_SR_OVR        ( SPI_SR_OVR_Msk )
#define SPI_SR_BSY_Pos    ( 7U )
#define SPI_SR_BSY_Msk    ( 0x1UL << SPI_SR_BSY_Pos )
#define SPI_SR_BSY        ( SPI_SR_BSY_Msk )
// Note: "Format error" bit doesn't show up in STM32F1 documentation.
#define SPI_SR_FERR_Pos   ( 8U )
#define SPI_SR_FERR_Msk   ( 0x1UL << SPI_SR_FERR_Pos )
#define SPI_SR_FERR       ( SPI_SR_FERR_Msk )


void delay_ms(uint32_t d) {
  for (uint32_t i = 0; i < (d * 1300); i++) {
    __asm__( "nop; nop; nop" );
  }
}

void delay_us(uint32_t d) {
  for (uint32_t i = 0; i < d; i++) {
    __asm__( "nop; nop; nop" );
  }
}

#endif
